Revit 2027 API
BuiltInFailures.StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure Property
 One leg of the winder run is too small or the runwidth is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; }
Public Shared ReadOnly Property WinderLegTooShortOrRunWidthTooGreatFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderLegTooShortOrRunWidthTooGreatFailure {
	FailureDefinitionId^ get ();
}
static member WinderLegTooShortOrRunWidthTooGreatFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace